Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДГ.Очистить();
	ДГ.ОтображатьПустыеЗначения = Ложь;
	
	Сч = 0;
	
	Если Параметры.Свойство("ЗначениеПараметра") Тогда
	
		Для Каждого Строка Из Параметры.ЗначениеПараметра Цикл

			Сч = Сч + 1;
			
			Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
			Точка.Текст = Строка.Сотрудник;
			Серия = ДГ.УстановитьСерию(Сч);
			
			МесяцОтпуска = Формат(Строка.ДатаНачала,"ДФ=ММММ");
			СтрокаТекстаСерии = МесяцОтпуска + " (Дней-" + (Строка.КоличествоДней + 1) + ")";
			Серия.Текст = СтрокаТекстаСерии;
		
			Значение = ДГ.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = Строка.ДатаНачала;
			Интервал.Конец = Строка.ДатаОкончания;
			
		КонецЦикла;
			
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
